OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f87.h
extern __at(0x009D) volatile __CVRCONbits_t CVRCONbits;

#define _CVR0                   0x01
#define _CVR1                   0x02
#define _CVR2                   0x04
#define _CVR3                   0x08
#define _CVRR                   0x20
#define _CVROE                  0x40
#define _CVREN                  0x80

//==============================================================================


//==============================================================================
//        WDTCON Bits

extern __at(0x0105) __sfr WDTCON;

typedef union
  {
  struct
    {
    unsigned SWDTEN             : 1;
    unsigned WDTPS0             : 1;
    unsigned WDTPS1             : 1;
    unsigned WDTPS2             : 1;
    unsigned WDTPS3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SWDTE              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned WDTPS              : 4;
    unsigned                    : 3;
    };
  } __WDTCONbits_t;

extern __at(0x0105) volatile __WDTCONbits_t WDTCONbits;

#define _SWDTEN                 0x01
#define _SWDTE                  0x01
#define _WDTPS0                 0x02
#define _WDTPS1                 0x04
#define _WDTPS2                 0x08
#define _WDTPS3                 0x10

//==============================================================================

extern __at(0x010C) __sfr EEDATA;
extern __at(0x010D) __sfr EEADR;
extern __at(0x010E) __sfr EEDATH;
extern __at(0x010F) __sfr EEADRH;

//==============================================================================
//        EECON1 Bits

extern __at(0x018C) __sfr EECON1;

typedef struct
  {
  unsigned RD                   : 1;
  unsigned WR                   : 1;
  unsigned WREN                 : 1;
  unsigned WRERR                : 1;
  unsigned FREE                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned EEPGD                : 1;
  } __EECON1bits_t;

extern __at(0x018C) volatile __EECON1bits_t EECON1bits;

#define _RD                     0x01
#define _WR                     0x02
#define _WREN                   0x04
#define _WRERR                  0x08
#define _FREE                   0x10
#define _EEPGD                  0x80

//==============================================================================

extern __at(0x018D) __sfr EECON2;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG1                0x2007
#define _CONFIG2                0x2008

//----------------------------- CONFIG1 Options -------------------------------

#define _FOSC_LP                0x3FEC  // LP oscillator.
#define _LP_OSC                 0x3FEC  // LP oscillator.
#define _FOSC_XT                0x3FED  // XT oscillator.
#define _XT_OSC                 0x3FED  // XT oscillator.
#define _FOSC_HS                0x3FEE  // HS oscillator.
#define _HS_OSC                 0x3FEE  // HS oscillator.
#define _FOSC_EC                0x3FEF  // ECIO; port I/O function on RA6/OSC2/CLKO.
#define _EXTCLK                 0x3FEF  // ECIO; port I/O function on RA6/OSC2/CLKO.
#define _FOSC_INTOSCIO          0x3FFC  // INTRC oscillator; port I/O function on both RA6/OSC2/CLKO pin and RA7/OSC1/CLKI pin.
#define _INTRC_IO               0x3FFC  // INTRC oscillator; port I/O function on both RA6/OSC2/CLKO pin and RA7/OSC1/CLKI pin.
#define _FOSC_INTOSCCLK         0x3FFD  // INTRC oscillator; CLKO function on RA6/OSC2/CLKO pin and port I/O function on RA7/OSC1/CLKI pin.
#define _INTRC_CLKOUT           0x3FFD  // INTRC oscillator; CLKO function on RA6/OSC2/CLKO pin and port I/O function on RA7/OSC1/CLKI pin.
#define _FOSC_EXTRCIO           0x3FFE  // EXTRC oscillator; port I/O function on RA6/OSC2/CLKO.
#define _EXTRC_IO               0x3FFE  // EXTRC oscillator; port I/O function on RA6/OSC2/CLKO.
#define _FOSC_EXTRCCLK          0x3FFF  // EXTRC oscillator; CLKO function on RA6/OSC2/CLKO.
#define _EXTRC_CLKOUT           0x3FFF  // EXTRC oscillator; CLKO function on RA6/OSC2/CLKO.
#define _WDTE_OFF               0x3FFB  // WDT disabled.
#define _WDT_OFF                0x3FFB  // WDT disabled.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FF7  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _MCLRE_OFF              0x3FDF  // RA5/MCLR/VPP pin function is digital I/O, MCLR internally tied to VDD.
#define _MCLR_OFF               0x3FDF  // RA5/MCLR/VPP pin function is digital I/O, MCLR internally tied to VDD.
#define _MCLRE_ON               0x3FFF  // RA5/MCLR/VPP pin function is MCLR.
#define _MCLR_ON                0x3FFF  // RA5/MCLR/VPP pin function is MCLR.
#define _BOREN_OFF              0x3FBF  // BOR disabled.
#define _BODEN_OFF              0x3FBF  // BOR disabled.
#define _BOREN_ON               0x3FFF  // BOR enabled.
#define _BODEN_ON               0x3FFF  // BOR enabled.
#define _LVP_OFF                0x3F7F  // RB3 is digital I/O, HV on MCLR must be used for programming.
#define _LVP_ON                 0x3FFF  // RB3/PGM pin has PGM function, Low-Voltage Programming enabled.
#define _CPD_ON                 0x3EFF  // Data EE memory code-protected.
#define _CPD_OFF                0x3FFF  // Code protection off.
#define _WRT_ALL                0x39FF  // 0000h to 0FFFh write-protected.
#define _WRT_PROTECT_ALL        0x39FF  // 0000h to 0FFFh write-protected.
#define _WRT_2048               0x3BFF  // 0000h to 07FFh write-protected, 0800h to 0FFFh may be modified by EECON control.
#define _WRT_PROTECT_2048       0x3BFF  // 0000h to 07FFh write-protected, 0800h to 0FFFh may be modified by EECON control.
#define _WRT_256                0x3DFF  // 0000h to 00FFh write-protected, 0100h to 0FFFh may be modified by EECON control.
#define _WRT_PROTECT_256        0x3DFF  // 0000h to 00FFh write-protected, 0100h to 0FFFh may be modified by EECON control.
#define _WRT_OFF                0x3FFF  // Write protection off.
#define _WRT_PROTECT_OFF        0x3FFF  // Write protection off.
#define _DEBUG_ON               0x37FF  // In-Circuit Debugger enabled, RB6 and RB7 are dedicated to the debugger.
#define _DEBUG_OFF              0x3FFF  // In-Circuit Debugger disabled, RB6 and RB7 are general purpose I/O pins.
#define _CCPMX_RB3              0x2FFF  // CCP1 function on RB3.
#define _CCP1_RB3               0x2FFF  // CCP1 function on RB3.
#define _CCPMX_RB0              0x3FFF  // CCP1 function on RB0.
#define _CCP1_RB0               0x3FFF  // CCP1 function on RB0.
#define _CP_ON                  0x1FFF  // 0000h to 0FFFh code-protected (all protected).
#define _CP_ALL                 0x1FFF  // 0000h to 0FFFh code-protected (all protected).
#define _CP_OFF                 0x3FFF  // Code protection off.

//----------------------------- CONFIG2 Options -------------------------------

